pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_tdm.h
/*
 * Copyright (c) 2024 - 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRF_TDM_H__
#define NRF_TDM_H__

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(HALTIUM_XXAA)
#define NRF_TDM_CLOCKPIN_SCK_NEEDED   1
#define NRF_TDM_CLOCKPIN_FSYNC_NEEDED 1
#define NRF_TDM_CLOCKPIN_MCK_NEEDED   1
#endif

/**
 * @defgroup nrf_tdm_hal TDM HAL
 * @{
 * @ingroup nrf_tdm
 * @brief   Hardware access layer for managing the Time Division Multiplexed Audio Interface
 *          (TDM) peripheral.
 */

/**
 * @brief This value can be provided as a parameter for the @ref nrf_tdm_pins_set
 *        function call to specify that the given TDM signal (SDOUT, SDIN, or MCK)
 *        shall not be connected to a physical pin.
 */
#define NRF_TDM_PIN_NOT_CONNECTED  0xFFFFFFFF

/** @brief TDM SCK pin selection mask. */
#define NRF_TDM_PSEL_SCK_PIN_MASK  TDM_PSEL_SCK_PIN_Msk

/** @brief TDM SCK port selection mask. */
#define NRF_TDM_PSEL_SCK_PORT_MASK TDM_PSEL_SCK_PORT_Msk

/** @brief TDM tasks. */
typedef enum
{
    NRF_TDM_TASK_START = offsetof(NRF_TDM_Type, TASKS_START), ///< Starts continuous TDM transfer. Also starts the MCK generator if this is enabled.
    NRF_TDM_TASK_STOP  = offsetof(NRF_TDM_Type, TASKS_STOP),  ///< Stops TDM transfer after completion of MAXCNT words.
    NRF_TDM_TASK_ABORT = offsetof(NRF_TDM_Type, TASKS_ABORT)  ///< Aborts TDM transfer without completing MAXCNT words.
} nrf_tdm_task_t;

/** @brief TDM events. */
typedef enum
{
    NRF_TDM_EVENT_RXPTRUPD    = offsetof(NRF_TDM_Type, EVENTS_RXPTRUPD),    ///< The RXD.PTR register has been copied to internal double buffers.
    NRF_TDM_EVENT_STOPPED     = offsetof(NRF_TDM_Type, EVENTS_STOPPED),     ///< TDM transfer stopped.
    NRF_TDM_EVENT_ABORTED     = offsetof(NRF_TDM_Type, EVENTS_ABORTED),     ///< TDM transfer aborted.
    NRF_TDM_EVENT_TXPTRUPD    = offsetof(NRF_TDM_Type, EVENTS_TXPTRUPD),    ///< The TXD.PTR register has been copied to internal double buffers.
    NRF_TDM_EVENT_MAXCNT      = offsetof(NRF_TDM_Type, EVENTS_MAXCNT),      ///< MAXCNT block event, generated on the active edge of FSYNC of every MAXCNT block.
} nrf_tdm_event_t;

/** @brief TDM interrupts. */
typedef enum
{
    NRF_TDM_INT_RXPTRUPD_MASK_MASK = TDM_INTENSET_RXPTRUPD_Msk,    ///< Interrupt on RXPTRUPD event.
    NRF_TDM_INT_STOPPED_MASK_MASK  = TDM_INTENSET_STOPPED_Msk,     ///< Interrupt on STOPPED event.
    NRF_TDM_INT_ABORTED_MASK       = TDM_INTENSET_ABORTED_Msk,     ///< Interrupt on EVENTS_ABORTED event.
    NRF_TDM_INT_TXPTRUPD_MASK_MASK = TDM_INTENSET_TXPTRUPD_Msk,    ///< Interrupt on TXPTRUPD event.
    NRF_TDM_INT_MAXCNT_MASK        = TDM_INTENSET_MAXCNT_Msk,      ///< Interrupt on EVENTS_MAXCNT event.
} nrf_tdm_int_mask_t;

/** @brief TDM modes of operation. */
typedef enum
{
    NRF_TDM_MODE_MASTER = TDM_CONFIG_MODE_MODE_Master, ///< Master mode.
    NRF_TDM_MODE_SLAVE  = TDM_CONFIG_MODE_MODE_Slave   ///< Slave mode.
} nrf_tdm_mode_t;

/** @brief TDM Reception and transmission settings. */
typedef enum
{
    NRF_TDM_RXTXEN_DUPLEX = TDM_CONFIG_RXTXEN_RXTXEN_Duplex, ///< Enable reception and transmission.
    NRF_TDM_RXTXEN_RX     = TDM_CONFIG_RXTXEN_RXTXEN_Rx,     ///< Enable reception, disable transmission.
    NRF_TDM_RXTXEN_TX     = TDM_CONFIG_RXTXEN_RXTXEN_Tx      ///< Enable transmission, disable reception.
} nrf_tdm_rxtxen_t;

/** @brief TDM master clock divider settings. */
typedef enum
{
    NRF_TDM_MCK_DIV_2   = TDM_CONFIG_MCK_DIV_DIV_CKDIV2,  ///< MCK divided by 2.
    NRF_TDM_MCK_DIV_3   = TDM_CONFIG_MCK_DIV_DIV_CKDIV3,  ///< MCK divided by 3.
    NRF_TDM_MCK_DIV_4   = TDM_CONFIG_MCK_DIV_DIV_CKDIV4,  ///< MCK divided by 4.
    NRF_TDM_MCK_DIV_5   = TDM_CONFIG_MCK_DIV_DIV_CKDIV5,  ///< MCK divided by 5.
    NRF_TDM_MCK_DIV_6   = TDM_CONFIG_MCK_DIV_DIV_CKDIV6,  ///< MCK divided by 6.
    NRF_TDM_MCK_DIV_8   = TDM_CONFIG_MCK_DIV_DIV_CKDIV8,  ///< MCK divided by 8.
    NRF_TDM_MCK_DIV_10  = TDM_CONFIG_MCK_DIV_DIV_CKDIV10, ///< MCK divided by 10.
    NRF_TDM_MCK_DIV_11  = TDM_CONFIG_MCK_DIV_DIV_CKDIV11, ///< MCK divided by 11.
    NRF_TDM_MCK_DIV_15  = TDM_CONFIG_MCK_DIV_DIV_CKDIV15, ///< MCK divided by 15.
    NRF_TDM_MCK_DIV_16  = TDM_CONFIG_MCK_DIV_DIV_CKDIV16, ///< MCK divided by 16.
    NRF_TDM_MCK_DIV_21  = TDM_CONFIG_MCK_DIV_DIV_CKDIV21, ///< MCK divided by 21.
    NRF_TDM_MCK_DIV_23  = TDM_CONFIG_MCK_DIV_DIV_CKDIV23, ///< MCK divided by 23.
    NRF_TDM_MCK_DIV_30  = TDM_CONFIG_MCK_DIV_DIV_CKDIV30, ///< MCK divided by 30.
    NRF_TDM_MCK_DIV_31  = TDM_CONFIG_MCK_DIV_DIV_CKDIV31, ///< MCK divided by 31.
    NRF_TDM_MCK_DIV_32  = TDM_CONFIG_MCK_DIV_DIV_CKDIV32, ///< MCK divided by 32.
    NRF_TDM_MCK_DIV_42  = TDM_CONFIG_MCK_DIV_DIV_CKDIV42, ///< MCK divided by 42.
    NRF_TDM_MCK_DIV_63  = TDM_CONFIG_MCK_DIV_DIV_CKDIV63, ///< MCK divided by 63.
    NRF_TDM_MCK_DIV_125 = TDM_CONFIG_MCK_DIV_DIV_CKDIV125 ///< MCK divided by 125.
} nrf_tdm_mck_div_t;

