pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_tdm.h
/** @brief TDM serial clock divider settings. */
typedef enum
{
    NRF_TDM_SCK_DIV_2   = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV2,  ///< SCK divided by 2.
    NRF_TDM_SCK_DIV_3   = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV3,  ///< SCK divided by 3.
    NRF_TDM_SCK_DIV_4   = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV4,  ///< SCK divided by 4.
    NRF_TDM_SCK_DIV_5   = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV5,  ///< SCK divided by 5.
    NRF_TDM_SCK_DIV_6   = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV6,  ///< SCK divided by 6.
    NRF_TDM_SCK_DIV_8   = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV8,  ///< SCK divided by 8.
    NRF_TDM_SCK_DIV_10  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV10, ///< SCK divided by 10.
    NRF_TDM_SCK_DIV_11  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV11, ///< SCK divided by 11.
    NRF_TDM_SCK_DIV_15  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV15, ///< SCK divided by 15.
    NRF_TDM_SCK_DIV_16  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV16, ///< SCK divided by 16.
    NRF_TDM_SCK_DIV_21  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV21, ///< SCK divided by 21.
    NRF_TDM_SCK_DIV_23  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV23, ///< SCK divided by 23.
    NRF_TDM_SCK_DIV_30  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV30, ///< SCK divided by 30.
    NRF_TDM_SCK_DIV_31  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV31, ///< SCK divided by 31.
    NRF_TDM_SCK_DIV_32  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV32, ///< SCK divided by 32.
    NRF_TDM_SCK_DIV_42  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV42, ///< SCK divided by 42.
    NRF_TDM_SCK_DIV_63  = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV63, ///< SCK divided by 63.
    NRF_TDM_SCK_DIV_125 = TDM_CONFIG_SCK_DIV_SCKDIV_CKDIV125 ///< SCK divided by 125.
} nrf_tdm_sck_div_t;

/** @brief TDM clock source selection. */
typedef enum
{
    NRF_TDM_SRC_PCLK32M = TDM_CONFIG_SCK_SRC_CLKSRC_PCLK32M, ///< 32MHz peripheral clock.
    NRF_TDM_SRC_ACLK    = TDM_CONFIG_SCK_SRC_CLKSRC_ACLK     ///< Audio PLL clock.
}  nrf_tdm_src_t;

/** @brief TDM sample widths. */
typedef enum
{
    NRF_TDM_SWIDTH_8BIT          = TDM_CONFIG_SWIDTH_SWIDTH_8Bit,      ///< 8 bit.
    NRF_TDM_SWIDTH_16BIT         = TDM_CONFIG_SWIDTH_SWIDTH_16Bit,     ///< 16 bit.
    NRF_TDM_SWIDTH_24BIT         = TDM_CONFIG_SWIDTH_SWIDTH_24Bit,     ///< 24 bit.
    NRF_TDM_SWIDTH_32BIT         = TDM_CONFIG_SWIDTH_SWIDTH_32Bit,     ///< 32 bit.
    NRF_TDM_SWIDTH_8BIT_IN16BIT  = TDM_CONFIG_SWIDTH_SWIDTH_8BitIn16,  ///< 8 bit sample in a 16-bit half-frame.
    NRF_TDM_SWIDTH_8BIT_IN32BIT  = TDM_CONFIG_SWIDTH_SWIDTH_8BitIn32,  ///< 8 bit sample in a 32-bit half-frame.
    NRF_TDM_SWIDTH_16BIT_IN32BIT = TDM_CONFIG_SWIDTH_SWIDTH_16BitIn32, ///< 16 bit sample in a 32-bit half-frame.
    NRF_TDM_SWIDTH_24BIT_IN32BIT = TDM_CONFIG_SWIDTH_SWIDTH_24BitIn32, ///< 24 bit sample in a 32-bit half-frame.
} nrf_tdm_swidth_t;

/** @brief TDM alignments of sample within a frame. */
typedef enum
{
    NRF_TDM_ALIGN_LEFT  = TDM_CONFIG_ALIGN_ALIGN_Left, ///< Left-aligned.
    NRF_TDM_ALIGN_RIGHT = TDM_CONFIG_ALIGN_ALIGN_Right ///< Right-aligned.
} nrf_tdm_align_t;

/** @brief TDM channel mask. */
typedef enum
{
    NRF_TDM_CHANNEL_RX0_MASK = TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Msk, ///< Enable RX channel 0 data.
    NRF_TDM_CHANNEL_RX1_MASK = TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Msk, ///< Enable RX channel 1 data.
    NRF_TDM_CHANNEL_RX2_MASK = TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Msk, ///< Enable RX channel 2 data.
    NRF_TDM_CHANNEL_RX3_MASK = TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Msk, ///< Enable RX channel 3 data.
    NRF_TDM_CHANNEL_RX4_MASK = TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Msk, ///< Enable RX channel 4 data.
    NRF_TDM_CHANNEL_RX5_MASK = TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Msk, ///< Enable RX channel 5 data.
    NRF_TDM_CHANNEL_RX6_MASK = TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Msk, ///< Enable RX channel 6 data.
    NRF_TDM_CHANNEL_RX7_MASK = TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Msk, ///< Enable RX channel 7 data.
    NRF_TDM_CHANNEL_TX0_MASK = TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Msk, ///< Enable TX channel 0 data.
    NRF_TDM_CHANNEL_TX1_MASK = TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Msk, ///< Enable TX channel 1 data.
    NRF_TDM_CHANNEL_TX2_MASK = TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Msk, ///< Enable TX channel 2 data.
    NRF_TDM_CHANNEL_TX3_MASK = TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Msk, ///< Enable TX channel 3 data.
    NRF_TDM_CHANNEL_TX4_MASK = TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Msk, ///< Enable TX channel 4 data.
    NRF_TDM_CHANNEL_TX5_MASK = TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Msk, ///< Enable TX channel 5 data.
    NRF_TDM_CHANNEL_TX6_MASK = TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Msk, ///< Enable TX channel 6 data.
    NRF_TDM_CHANNEL_TX7_MASK = TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Msk, ///< Enable TX channel 7 data.
} nrf_tdm_channel_mask_t;

/** @brief TDM number of channels. */
typedef enum
{
    NRF_TDM_CHANNELS_COUNT_1 = TDM_CONFIG_CHANNEL_NUM_NUM_Tdm1Ch, ///< 1 channel audio (mono).
    NRF_TDM_CHANNELS_COUNT_2 = TDM_CONFIG_CHANNEL_NUM_NUM_Tdm2Ch, ///< 2 channels audio (stereo).
    NRF_TDM_CHANNELS_COUNT_3 = TDM_CONFIG_CHANNEL_NUM_NUM_Tdm3Ch, ///< 3 channels audio.
    NRF_TDM_CHANNELS_COUNT_4 = TDM_CONFIG_CHANNEL_NUM_NUM_Tdm4Ch, ///< 4 channels audio.
    NRF_TDM_CHANNELS_COUNT_5 = TDM_CONFIG_CHANNEL_NUM_NUM_Tdm5Ch, ///< 5 channels audio.
    NRF_TDM_CHANNELS_COUNT_6 = TDM_CONFIG_CHANNEL_NUM_NUM_Tdm6Ch, ///< 6 channels audio.
    NRF_TDM_CHANNELS_COUNT_7 = TDM_CONFIG_CHANNEL_NUM_NUM_Tdm7Ch, ///< 7 channels audio.
    NRF_TDM_CHANNELS_COUNT_8 = TDM_CONFIG_CHANNEL_NUM_NUM_Tdm8Ch, ///< 8 channels audio.
} nrf_tdm_channels_count_t;

/** @brief TDM channel delay. */
typedef enum
{
    NRF_TDM_CHANNEL_DELAY_NONE = TDM_CONFIG_CHANNEL_DELAY_DELAY_Delay0Ck, ///< No delay. Use with DSP/Aligned format.
    NRF_TDM_CHANNEL_DELAY_1CK  = TDM_CONFIG_CHANNEL_DELAY_DELAY_Delay1Ck, ///< 1 clock pulse delay. Used with original TDM format.
    NRF_TDM_CHANNEL_DELAY_2CK  = TDM_CONFIG_CHANNEL_DELAY_DELAY_Delay2Ck, ///< 2 clock pulses delay.
} nrf_tdm_channel_delay_t;

/** @brief TDM signal polarity. */
typedef enum
{
    NRF_TDM_POLARITY_POSEDGE, ///< Synchronization at rising edge of the reference signal.
    NRF_TDM_POLARITY_NEGEDGE, ///< Synchronization at falling edge of the reference signal.
}  nrf_tdm_polarity_t;

/** @brief TDM frame synchronization pulse duration. */
typedef enum
{
    NRF_TDM_FSYNC_DURATION_SCK     = TDM_CONFIG_FSYNC_DURATION_DURATION_Sck,    ///< FSYNC is active for the duration of one SCK pulse.
    NRF_TDM_FSYNC_DURATION_CHANNEL = TDM_CONFIG_FSYNC_DURATION_DURATION_Channel ///< FSYNC is active for the duration of channel transmission.
}  nrf_tdm_fsync_duration_t;

