pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_tdm.h
/** @brief TDM configuration. */
typedef struct
{
    nrf_tdm_mode_t           mode;
    nrf_tdm_align_t          alignment;
    nrf_tdm_swidth_t         sample_width;
    nrf_tdm_channel_mask_t   channels;
    nrf_tdm_channels_count_t num_of_channels;
    nrf_tdm_channel_delay_t  channel_delay;
    nrf_tdm_mck_div_t        mck_setup;
    nrf_tdm_sck_div_t        sck_setup;
    nrf_tdm_polarity_t       sck_polarity;
    nrf_tdm_polarity_t       fsync_polarity;
    nrf_tdm_fsync_duration_t fsync_duration;
} nrf_tdm_config_t;

/** @brief TDM pins. */
typedef struct
{
    uint32_t sck_pin;   ///< SCK pin number.
    uint32_t fsync_pin; ///< FSYNC pin number.
    uint32_t mck_pin;   ///< MCK pin number.
                        /**< Optional. Use @ref NRF_TDM_PIN_NOT_CONNECTED
                         *   if this signal is not needed. */
    uint32_t sdout_pin; ///< SDOUT pin number.
                        /**< Optional. Use @ref NRF_TDM_PIN_NOT_CONNECTED
                         *   if this signal is not needed. */
    uint32_t sdin_pin;  ///< SDIN pin number.
                        /**< Optional. Use @ref NRF_TDM_PIN_NOT_CONNECTED
                         *   if this signal is not needed. */
} nrf_tdm_pins_t;

/**
 * @brief Function for activating the specified TDM task.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Task to be activated.
 */
NRF_STATIC_INLINE void nrf_tdm_task_trigger(NRF_TDM_Type * p_reg,
                                            nrf_tdm_task_t task);

/**
 * @brief Function for getting the address of the specified TDM task register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Specified task.
 *
 * @return Address of the specified task register.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_task_address_get(NRF_TDM_Type const * p_reg,
                                                    nrf_tdm_task_t       task);

/**
 * @brief Function for clearing the specified TDM event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to clear.
 */
NRF_STATIC_INLINE void nrf_tdm_event_clear(NRF_TDM_Type *  p_reg,
                                           nrf_tdm_event_t event);

/**
 * @brief Function for retrieving the state of the TDM event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to be checked.
 *
 * @retval true  The event has been generated.
 * @retval false The event has not been generated.
 */
NRF_STATIC_INLINE bool nrf_tdm_event_check(NRF_TDM_Type const * p_reg,
                                           nrf_tdm_event_t      event);

/**
 * @brief Function for getting the address of the specified TDM event register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Specified event.
 *
 * @return Address of the specified event register.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_event_address_get(NRF_TDM_Type const * p_reg,
                                                     nrf_tdm_event_t      event);

/**
 * @brief Function for enabling specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be enabled.
 *                  Use @ref nrf_tdm_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_tdm_int_enable(NRF_TDM_Type * p_reg, uint32_t mask);

/**
 * @brief Function for disabling specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be disabled.
 *                  Use @ref nrf_tdm_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_tdm_int_disable(NRF_TDM_Type * p_reg, uint32_t mask);

/**
 * @brief Function for checking if the specified interrupts are enabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be checked.
 *                  Use @ref nrf_tdm_int_mask_t values for bit masking.
 *
 * @return Mask of enabled interrupts.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_int_enable_check(NRF_TDM_Type const * p_reg, uint32_t mask);

/**
 * @brief Function for enabling the TDM peripheral.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 */
NRF_STATIC_INLINE void nrf_tdm_enable(NRF_TDM_Type * p_reg);

/**
 * @brief Function for disabling the TDM peripheral.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 */
NRF_STATIC_INLINE void nrf_tdm_disable(NRF_TDM_Type * p_reg);

/**
 * @brief Function for checking if the TDM peripheral is enabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval true  The TDM is enabled.
 * @retval false The TDM is not enabled.
 */
NRF_STATIC_INLINE bool nrf_tdm_enable_check(NRF_TDM_Type * p_reg);

#if defined(DPPI_PRESENT) || defined(__NRFX_DOXYGEN__)
/**
 * @brief Function for setting the subscribe configuration for a given
 *        TDM task.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] task    Task for which to set the configuration.
 * @param[in] channel Channel through which to subscribe events.
 */
NRF_STATIC_INLINE void nrf_tdm_subscribe_set(NRF_TDM_Type * p_reg,
                                             nrf_tdm_task_t task,
                                             uint8_t        channel);

/**
 * @brief Function for clearing the subscribe configuration for a given
 *        TDM task.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Task for which to clear the configuration.
 */
NRF_STATIC_INLINE void nrf_tdm_subscribe_clear(NRF_TDM_Type * p_reg,
                                               nrf_tdm_task_t task);

/**
 * @brief Function for setting the publish configuration for a given
 *        TDM event.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] event   Event for which to set the configuration.
 * @param[in] channel Channel through which to publish the event.
 */
NRF_STATIC_INLINE void nrf_tdm_publish_set(NRF_TDM_Type *  p_reg,
                                           nrf_tdm_event_t event,
                                           uint8_t         channel);

/**
 * @brief Function for clearing the publish configuration for a given
 *        TDM event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event for which to clear the configuration.
 */
NRF_STATIC_INLINE void nrf_tdm_publish_clear(NRF_TDM_Type *  p_reg,
                                             nrf_tdm_event_t event);
#endif // defined(DPPI_PRESENT) || defined(__NRFX_DOXYGEN__)

/**
 * @brief Function for configuring TDM pins.
 *
 * Usage of the SDOUT, SDIN, and MCK signals is optional.
 * If a given signal is not needed, pass the @ref NRF_TDM_PIN_NOT_CONNECTED
 * value instead of its pin number.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] p_pins Pointer to the structure with pins selection.
 */
NRF_STATIC_INLINE void nrf_tdm_pins_set(NRF_TDM_Type * p_reg, nrf_tdm_pins_t const * p_pins);

/**
 * @brief Function for getting the SCK pin selection.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return SCK pin selection.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_sck_pin_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for getting the FSYNC pin selection.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return FSYNC pin selection.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_fsync_pin_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for getting the MCK pin selection.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return MCK pin selection.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_mck_pin_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for getting the SDOUT pin selection.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return SDOUT pin selection.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_sdout_pin_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for getting the SDIN pin selection.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return SDIN pin selection.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_sdin_pin_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for setting the TDM peripheral configuration.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] p_config Pointer to the structure with configuration.
 */
NRF_STATIC_INLINE void nrf_tdm_configure(NRF_TDM_Type * p_reg, nrf_tdm_config_t const * p_config);

/**
 * @brief Function for setting the master clock generator.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] enable True if the master clock generator is to be enabled, false otherwise.
 */
NRF_STATIC_INLINE void nrf_tdm_mck_set(NRF_TDM_Type * p_reg, bool enable);

/**
 * @brief Function for setting up the TDM RX transfer length.
 *
 * @note This function sets up the RX buffer size. At least one of
 *       @ref nrf_tdm_rx_count_set or @ref nrf_tdm_tx_count_set functions must be called
 *       before starting the transmission. Also @ref nrf_tdm_transfer_direction_set and
 *       @ref nrf_tdm_rx_buffer_set should be called before starting the transmission.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] size     Size of the buffer (in 32-bit words).
 */
NRF_STATIC_INLINE void nrf_tdm_rx_count_set(NRF_TDM_Type * p_reg,
                                            uint16_t       size);

/**
 * @brief Function for setting up the TDM TX transfer length.
 *
 * @note This function sets up the RX buffer size. At least one of
 *       @ref nrf_tdm_rx_count_set or @ref nrf_tdm_tx_count_set functions must be called
 *       before starting the transmission. Also @ref nrf_tdm_transfer_direction_set and
 *       @ref nrf_tdm_tx_buffer_set should be called before starting the transmission.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] size     Size of the buffer (in 32-bit words).
 */
NRF_STATIC_INLINE void nrf_tdm_tx_count_set(NRF_TDM_Type * p_reg,
                                            uint16_t       size);

/**
 * @brief Function for setting up the direction of the TDM transfer.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] dir   Transmission direction.
 */
NRF_STATIC_INLINE void nrf_tdm_transfer_direction_set(NRF_TDM_Type *   p_reg,
                                                      nrf_tdm_rxtxen_t dir);

/**
 * @brief Function for setting the pointer to the receive buffer.
 *
 * @note The size of the buffer can be set only by calling
 *       @ref nrf_tdm_rx_count_set.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] p_buffer Pointer to the receive buffer.
 */
NRF_STATIC_INLINE void nrf_tdm_rx_buffer_set(NRF_TDM_Type * p_reg,
                                             uint32_t *     p_buffer);

/**
 * @brief Function for getting the pointer to the receive buffer.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Pointer to the receive buffer.
 */
NRF_STATIC_INLINE uint32_t * nrf_tdm_rx_buffer_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for setting the pointer to the transmit buffer.
 *
 * @note The size of the buffer can be set only by calling
 *       @ref nrf_tdm_tx_count_set.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] p_buffer Pointer to the transmit buffer.
 */
NRF_STATIC_INLINE void nrf_tdm_tx_buffer_set(NRF_TDM_Type *   p_reg,
                                             uint32_t const * p_buffer);

/**
 * @brief Function for getting the number of bytes transferred in the current transaction.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Number of bytes transferred.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_current_tx_transfer_amount_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for getting the number of bytes transferred in the last transaction.
 *        The value has been updated after the END event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Number of bytes transferred.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_last_tx_transfer_amount_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for getting the number of bytes received in the current transaction.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Number of bytes received.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_current_rx_transfer_amount_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for getting the number of bytes received in the last transaction.
 *        The value has been updated after the END event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Number of bytes received.
 */
NRF_STATIC_INLINE uint32_t nrf_tdm_last_rx_transfer_amount_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for getting the pointer to the transmit buffer.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Pointer to the transmit buffer.
 */
NRF_STATIC_INLINE uint32_t * nrf_tdm_tx_buffer_get(NRF_TDM_Type const * p_reg);

/**
 * @brief Function for configuring TDM master Clock.
 *
 * @param[in] p_reg         Pointer to the structure of registers of the peripheral.
 * @param[in] clksrc        TDM master clock source selection.
 * @param[in] enable_bypass Bypass clock generator. MCK will be equal to source input.
 *                          If bypass is enabled the MCK.DIV setting has no effect.
 */
NRF_STATIC_INLINE void nrf_tdm_mck_configure(NRF_TDM_Type * p_reg,
                                             nrf_tdm_src_t  clksrc,
                                             bool           enable_bypass);

/**
 * @brief Function for configuring TDM serial Clock.
 *
 * @param[in] p_reg         Pointer to the structure of registers of the peripheral.
 * @param[in] clksrc        TDM serial clock source selection.
 * @param[in] enable_bypass Bypass clock generator. SCK will be equal to source input.
 *                          If bypass is enabled the SCK.DIV setting has no effect.
 */
NRF_STATIC_INLINE void nrf_tdm_sck_configure(NRF_TDM_Type * p_reg,
                                             nrf_tdm_src_t  clksrc,
                                             bool           enable_bypass);

#ifndef NRF_DECLARE_ONLY

