pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_tdm.h
NRF_STATIC_INLINE void nrf_tdm_task_trigger(NRF_TDM_Type * p_reg,
                                            nrf_tdm_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 0x1UL;
}

NRF_STATIC_INLINE uint32_t nrf_tdm_task_address_get(NRF_TDM_Type const * p_reg,
                                                    nrf_tdm_task_t       task)
{
    return nrf_task_event_address_get(p_reg, task);
}

NRF_STATIC_INLINE void nrf_tdm_event_clear(NRF_TDM_Type *  p_reg,
                                           nrf_tdm_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
    nrf_event_readback((uint8_t *)p_reg + (uint32_t)event);
}

NRF_STATIC_INLINE bool nrf_tdm_event_check(NRF_TDM_Type const * p_reg,
                                           nrf_tdm_event_t      event)
{
    return nrf_event_check(p_reg, event);
}

NRF_STATIC_INLINE uint32_t nrf_tdm_event_address_get(NRF_TDM_Type const * p_reg,
                                                     nrf_tdm_event_t      event)
{
    return nrf_task_event_address_get(p_reg, event);
}

NRF_STATIC_INLINE void nrf_tdm_int_enable(NRF_TDM_Type * p_reg, uint32_t mask)
{
    p_reg->INTENSET = mask;
}

NRF_STATIC_INLINE void nrf_tdm_int_disable(NRF_TDM_Type * p_reg, uint32_t mask)
{
    p_reg->INTENCLR = mask;
}

NRF_STATIC_INLINE uint32_t nrf_tdm_int_enable_check(NRF_TDM_Type const * p_reg, uint32_t mask)
{
    return p_reg->INTENSET & mask;
}

NRF_STATIC_INLINE void nrf_tdm_enable(NRF_TDM_Type * p_reg)
{
    p_reg->ENABLE = (TDM_ENABLE_ENABLE_Enabled << TDM_ENABLE_ENABLE_Pos);
}

NRF_STATIC_INLINE void nrf_tdm_disable(NRF_TDM_Type * p_reg)
{
    p_reg->ENABLE = (TDM_ENABLE_ENABLE_Disabled << TDM_ENABLE_ENABLE_Pos);
}

NRF_STATIC_INLINE bool nrf_tdm_enable_check(NRF_TDM_Type * p_reg)
{
    return p_reg->ENABLE == (TDM_ENABLE_ENABLE_Enabled << TDM_ENABLE_ENABLE_Pos);
}

#if defined(DPPI_PRESENT)
NRF_STATIC_INLINE void nrf_tdm_subscribe_set(NRF_TDM_Type * p_reg,
                                             nrf_tdm_task_t task,
                                             uint8_t        channel)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) task + 0x80uL)) =
            ((uint32_t)channel | NRF_SUBSCRIBE_PUBLISH_ENABLE);
}

NRF_STATIC_INLINE void nrf_tdm_subscribe_clear(NRF_TDM_Type * p_reg,
                                               nrf_tdm_task_t task)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) task + 0x80uL)) = 0;
}

NRF_STATIC_INLINE void nrf_tdm_publish_set(NRF_TDM_Type *  p_reg,
                                           nrf_tdm_event_t event,
                                           uint8_t         channel)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) event + 0x80uL)) =
            ((uint32_t)channel | NRF_SUBSCRIBE_PUBLISH_ENABLE);
}

NRF_STATIC_INLINE void nrf_tdm_publish_clear(NRF_TDM_Type *  p_reg,
                                             nrf_tdm_event_t event)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) event + 0x80uL)) = 0;
}
#endif // defined(DPPI_PRESENT)

NRF_STATIC_INLINE void nrf_tdm_pins_set(NRF_TDM_Type * p_reg, nrf_tdm_pins_t const * p_pins)
{
    p_reg->PSEL.SCK   = p_pins->sck_pin;
    p_reg->PSEL.FSYNC  = p_pins->fsync_pin;
    p_reg->PSEL.MCK   = p_pins->mck_pin;
    p_reg->PSEL.SDOUT = p_pins->sdout_pin;
    p_reg->PSEL.SDIN  = p_pins->sdin_pin;
}

NRF_STATIC_INLINE uint32_t nrf_tdm_sck_pin_get(NRF_TDM_Type const * p_reg)
{
    return p_reg->PSEL.SCK;
}

NRF_STATIC_INLINE uint32_t nrf_tdm_fsync_pin_get(NRF_TDM_Type const * p_reg)
{
    return p_reg->PSEL.FSYNC;
}

NRF_STATIC_INLINE uint32_t nrf_tdm_mck_pin_get(NRF_TDM_Type const * p_reg)
{
    return p_reg->PSEL.MCK;
}

NRF_STATIC_INLINE uint32_t nrf_tdm_sdout_pin_get(NRF_TDM_Type const * p_reg)
{
    return p_reg->PSEL.SDOUT;
}

NRF_STATIC_INLINE uint32_t nrf_tdm_sdin_pin_get(NRF_TDM_Type const * p_reg)
{
    return p_reg->PSEL.SDIN;
}

NRF_STATIC_INLINE void nrf_tdm_configure(NRF_TDM_Type * p_reg, nrf_tdm_config_t const * p_config)
{
    p_reg->CONFIG.MODE           = p_config->mode;
    p_reg->CONFIG.ALIGN          = p_config->alignment;
    p_reg->CONFIG.SWIDTH         = p_config->sample_width;
    p_reg->CONFIG.CHANNEL.MASK   = p_config->channels;
    p_reg->CONFIG.CHANNEL.NUM    = p_config->num_of_channels;
    p_reg->CONFIG.CHANNEL.DELAY  = p_config->channel_delay;
    p_reg->CONFIG.SCK.DIV        = p_config->sck_setup;
    p_reg->CONFIG.FSYNC.DURATION = p_config->fsync_duration;
    p_reg->CONFIG.MCK.DIV        = p_config->mck_setup;
    p_reg->CONFIG.SCK.POLARITY   = (p_config->sck_polarity == NRF_TDM_POLARITY_POSEDGE) ?
                                   (TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_PosEdge) :
                                   (TDM_CONFIG_SCK_POLARITY_SCKPOLARITY_NegEdge);
    p_reg->CONFIG.FSYNC.POLARITY = (p_config->fsync_polarity == NRF_TDM_POLARITY_POSEDGE) ?
                                   (TDM_CONFIG_FSYNC_POLARITY_POLARITY_PosEdge) :
                                   (TDM_CONFIG_FSYNC_POLARITY_POLARITY_NegEdge);
}

NRF_STATIC_INLINE void nrf_tdm_mck_set(NRF_TDM_Type * p_reg, bool enable)
{
    p_reg->CONFIG.MCK.EN = ((p_reg->CONFIG.MCK.EN & ~TDM_CONFIG_MCK_EN_MCKEN_Msk) |
                            ((enable ? TDM_CONFIG_MCK_EN_MCKEN_Enabled :
                             TDM_CONFIG_MCK_EN_MCKEN_Disabled) << TDM_CONFIG_MCK_EN_MCKEN_Pos));
}

NRF_STATIC_INLINE void nrf_tdm_rx_count_set(NRF_TDM_Type * p_reg,
                                            uint16_t       size)
{
#if defined(DMA_BUFFER_UNIFIED_BYTE_ACCESS)
    p_reg->RXD.MAXCNT = size * sizeof(uint32_t);
#else
    p_reg->RXD.MAXCNT = (uint32_t)size;
#endif
}

NRF_STATIC_INLINE void nrf_tdm_tx_count_set(NRF_TDM_Type * p_reg,
                                            uint16_t       size)
{
#if defined(DMA_BUFFER_UNIFIED_BYTE_ACCESS)
    p_reg->TXD.MAXCNT = size * sizeof(uint32_t);
#else
    p_reg->TXD.MAXCNT = (uint32_t)size;
#endif
}

NRF_STATIC_INLINE void nrf_tdm_transfer_direction_set(NRF_TDM_Type *   p_reg,
                                                      nrf_tdm_rxtxen_t dir)
{
    p_reg->CONFIG.RXTXEN = (dir << TDM_CONFIG_RXTXEN_RXTXEN_Pos);
}

NRF_STATIC_INLINE void nrf_tdm_rx_buffer_set(NRF_TDM_Type * p_reg,
                                             uint32_t *     p_buffer)
{
    p_reg->RXD.PTR = (uint32_t)p_buffer;
}

